package org.javaguru.student_andrey_klimenko.lesson_2_variables_and_data_types.level_4;
/*Команда System.out.println("text"); выводит указанный "text"
        на консоль, и переводит курсор на новую строку.

        Для того, что бы выводить текст на консоль без перевода курсора на
новую строку можно воспользоваться командой
    System.out.print("text");
эта команда распечатает текст на консоль и оставит курсор в той же строке.

        Напишите программу, которая демонстрирует использование команды
    System.out.print("text");
*/
public class PrintString {

    public static void main(String[] args) {
        System.out.print("Text");
    }
}
